Repository: pypi-data/pypi-mirror-84
Catalog: packages/kitconcept.glossary/kitconcept.glossary-1.1.0-py3-none-any.whl/kitconcept/glossary/locales/*/LC_MESSAGES/kitconcept.glossary.po
Languages: de

source: A Dexterity-based content type to define a glossary and its terms.
de: Dexterity-basierter Inhaltstyp, um ein Glossar zu definieren.

source: All
de: Alle

source: Body text
de: Text

source: Description ellipsis
de: Auslassungszeichen Beschreibung

source: Description length
de: Länge Beschreibung

source: Enable tooltip.
de: Tooltip aktivieren

source: Enable tooltip?
de: Tooltip aktivieren?

source: Enabled Content Types
de: Inhaltstyp aktivieren

source: Enter the body text.
de: Geben Sie einen Text ein

source: Enter the variants of the term, one per line.
de: Alternative Bezeichnungen, je Zeile ein Begriff

source: Glossary
de: Glossar

source: Glossary Term
de: Glossareintrag

source: GlossaryTerm
de: Glossareintrag

source: Only objects of these content types will display glossary terms.
de: Nur Inhalte dieses Inhaltstyps zeigen Glossareinträge an.

source: Search
de: Suche

source: Settings
de: Einstellungen

source: Settings for the kitconcept.glossary package
de: Einstellungen für das kitconcept.glossary Paket

source: Uninstall kitconcept.glossary.
de: kitconcept.glossary deinstallieren

source: Variants
de: Varianten

source: Variants:
de: Varianten:

source: help_exclude_from_nav
de: Wenn ausgewählt, erscheint dieser Inhalt nicht im Navigationsbaum

source: kitconcept.glossary: uninstall
de: Deinstallieren

source: label_exclude_from_nav
de: Von der Navigation ausschließen

source: label_text_search
de: Suchen
