Repository: pypi-data/pypi-mirror-84
Catalog: packages/Products.MeetingCharleroi/Products.MeetingCharleroi-4.1.7.tar.gz/Products.MeetingCharleroi-4.1.7/src/Products/MeetingCharleroi/locales/*/LC_MESSAGES/plone.po
Languages: fr

source: MeetingBourgmestre
fr: Séance du Bourgmestre

source: MeetingItemBourgmestre
fr: Point Bourgmestre

source: MeetingItemRecurringBourgmestre
fr: Point récurrent Bourgmestre

source: MeetingItemTemplateBourgmestre
fr: Modèle de point Bourgmestre

source: backToItemCreatedFromPrevalidated
fr: Remettre "En création"

source: backToPrevalidated
fr: Renvoyer au directeur

source: backToProposed
fr: Renvoyer au chef de service

source: backToProposedFromPrevalidated
fr: Renvoyer au chef de service

source: backToProposedToRefAdmin
fr: Renvoyer au référent administratif

source: backTo_prevalidated_from_waiting_advices
fr: Renvoyer au directeur

source: backTo_proposed_from_waiting_advices
fr: Renvoyer au chef de service

source: backTo_proposed_to_refadmin_from_waiting_advices
fr: Renvoyer au référent administratif

source: backTo_validated_from_waiting_advices
fr: Valider (via avis Directeur financier)

source: prevalidate
fr: Proposer au directeur

source: prevalidated
fr: Proposé au directeur

source: prevalidated_waiting_advices
fr: En attente avis finances

source: propose
fr: Proposer au chef de service

source: proposeToRefAdmin
fr: Proposer au référent administratif

source: proposed
fr: Proposé au chef de service

source: proposed_to_refadmin
fr: Proposé au référent administratif

source: proposed_waiting_advices
fr: En attente des avis (Proposé au chef de service)

source: wait_advices_from_prevalidated
fr: Demander l'avis des finances
