Repository: pypi-data/pypi-mirror-84
Catalog: packages/Products.MeetingCharleroi/Products.MeetingCharleroi-4.1.7.tar.gz/Products.MeetingCharleroi-4.1.7/src/Products/MeetingCharleroi/locales/*/LC_MESSAGES/PloneMeeting.po
Languages: fr

# MeetingCharleroi_label_advice_category
source: Category
fr: Catégorie

# MeetingCharleroi_label_advice_motivation_categories
source: Motivation categories
fr: Catégories de la motivation

source: PloneMeeting_bourgmestreObservations
fr: Observations Bourgmestre

source: PloneMeeting_label_assemblyPolice
fr: Présents pour la Zone de Police par défaut

source: PloneMeeting_label_assemblyPrivacySecretAbsents
fr: Absents pour la séance à huis clos

source: PloneMeeting_label_decision
fr: Dispositif

source: PloneMeeting_label_itemDescription
fr: Exposé du point

source: PloneMeeting_label_motivation
fr: Préambule

source: assembly_police_descr
fr: Définissez ici les présents pour la Police par défaut (par exemple, une liste de noms et prénoms séparés par des virgules ou des retours à la ligne) qui sera automatiquement sélectionnée pour chaque séance nouvellement créée.

source: bourgmestre_observations_descr
fr: Ces observations ne sont visibles et éditables que par les gestionnaires de séances.

source: category_indeterminee_not_allowed
fr: Cette catégorie ne peut être utilisée que pour les points à envoyer au Conseil communal

source: category_must_be_indeterminee
fr: La catégorie 'Indéterminée' est obligatoire pour les points à envoyer au Conseil

# completeness_asked_again_by_app
source: The completeness has been asked again by the application when the item has been proposed to the finances.
fr: La complétude a été remise automatiquement par l'application en 'Evaluation demandée à nouveau' lorsque le point a été proposé aux finances.

# finance_advice_not_giveable_because_item_not_complete
source: Advice is still not giveable because item is not considered complete.
fr: Cet avis ne pourra être rendu que lorsque le point sera considéré 'complet'.

# finance_advice_suspended_because_item_sent_back_to_proposing_group
source: Advice is suspended because it was sent back to proposing group.
fr: Cet avis est suspendu car le point a été renvoyé vers le groupe proposant.

# icon_help_prevalidated
source: Pre-validated
fr: Proposé au directeur

# icon_help_proposed_to_refadmin
source: Proposed to admin referent
fr: Proposé au référent administratif

# icon_help_waiting_advices_from_prevalidated
source: Waiting finances advice
fr: En attente avis finances

source: icon_help_waiting_advices_from_proposed
fr: En attente des avis (Proposé au chef de service)

source: late
fr: Urgence

source: meeting_assemblyPolice
fr: Présents pour la Zone de Police

# no_finances_advice_asked
source: The finances advice has not been selected on this item.
fr: L'avis des finances n'a pas été demandé sur ce point.

source: on_communication
fr: Par "Communication/Conseil communal - Arrêt de l'ordre du jour" (points utilisant les catégories "Communication/Conseil communal - Arrêt de l'ordre du jour" puis les points utilisant les autres catégories)

source: on_police_then_other_groups
fr: Points "Zone de Police" puis points des Services communaux

source: prereviewer
fr: Référent administratif

source: prereviewers
fr: Référents administratifs

source: reviewer
fr: Directeur

source: reviewers
fr: Directeurs

source: sentBackToRefAdminWhileSigningNotPositiveFinancesAdvice
fr: Un point a été automatiquement renvoyé aux référents administratifs parce que l'avis finances signé n'était pas 'Favorable' (prévient les directeurs du groupe proposant)

source: sentBackToRefAdminWhileSigningNotPositiveFinancesAdvice_mail_body
fr: Le titre du point est '${itemTitle}'. Vous pouvez y accéder ici: ${objectUrl}.

source: sentBackToRefAdminWhileSigningNotPositiveFinancesAdvice_mail_subject
fr: Un point a été renvoyé aux référents administratifs par les finances

source: serviceheads
fr: Chefs de service

source: wa_charleroi_add_refadmin
fr: Ajout du référent administratif

source: wa_charleroi_return_to_any_state_when_prevalidated
fr: Ajouter les transitions "retour" depuis l'état "Proposé au directeur" (prevalidated)

source: wa_waiting_advices
fr: Etats supplémentaires pour demander les avis ("en création", "proposé au chef de service", "aux finances")
